src/test/resources/benchmark_out/2024-08-03/ryzen_3700X/out_pdf-fop-pool.log
starting benchmark...
spawning thread #0: 15 total client(s). 12500 total requests
spawning thread #1: 15 total client(s). 12500 total requests
spawning thread #2: 15 total client(s). 12500 total requests
spawning thread #3: 15 total client(s). 12500 total requests
Application protocol: h2c
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 19.66s, 2543.10 req/s, 42.63MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 838.19MB (878903320) total, 148.48KB (152040) headers (space savings 94.57%), 836.66MB (877299960) data
                     min         max         mean         sd        +/- sd
time for request:     1.94ms    313.74ms     23.27ms     24.73ms    90.20%
time for connect:      115us       895us       464us       213us    61.67%
time to 1st byte:    13.28ms    231.31ms     81.44ms     54.54ms    63.33%
req/s           :      42.42       44.15       42.97        0.44    73.33%