src/test/resources/benchmark_out/2024-08-03/ryzen_3700X/out_pdf-fop.log
starting benchmark...
spawning thread #0: 15 total client(s). 12500 total requests
spawning thread #1: 15 total client(s). 12500 total requests
spawning thread #2: 15 total client(s). 12500 total requests
spawning thread #3: 15 total client(s). 12500 total requests
Application protocol: h2c
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 28.07s, 1781.52 req/s, 29.86MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 838.19MB (878903320) total, 148.48KB (152040) headers (space savings 94.57%), 836.66MB (877299960) data
                     min         max         mean         sd        +/- sd
time for request:     2.16ms    961.56ms     33.23ms     45.18ms    93.15%
time for connect:      113us      1.05ms       519us       234us    65.00%
time to 1st byte:     9.94ms    402.69ms     88.14ms     77.04ms    83.33%
req/s           :      29.69       31.46       30.09        0.39    83.33%